In [66]:
import numpy as np
import pandas as pd

In [67]:
dict1 = {
    "name":['Josh', 'Jayshil', 'Pravin', 'Aakash', 'Krenil'],
    "marks":[80, 85, 82, 75, 70],
    "state":['Gujarat','Rajasthan','Tamilnadu', 'Rajasthan', 'Gujarat'] #created a dictionary.
}

In [68]:
df = pd.DataFrame(dict1)    #crated a dataframe with arranged data.

In [69]:
df

      name  marks      state
0     Josh     80    Gujarat
1  Jayshil     85  Rajasthan
2   Pravin     82  Tamilnadu
3   Aakash     75  Rajasthan
4   Krenil     70    Gujarat

In [70]:
df.to_csv('friends.csv')    #crated a csv file and addded data to it.

In [71]:
df.to_csv('friends_indexfalse.csv', index=False)    #created another csv but with no index.

In [72]:
df.head(3)  #first three rows.

      name  marks      state
0     Josh     80    Gujarat
1  Jayshil     85  Rajasthan
2   Pravin     82  Tamilnadu

In [73]:
df.tail(2)  #last two rows.

     name  marks      state
3  Aakash     75  Rajasthan
4  Krenil     70    Gujarat

In [74]:
df.describe()   #analysis the numerical component of dataframe.

          marks
count   5.00000
mean   78.40000
std     5.94138
min    70.00000
25%    75.00000
50%    80.00000
75%    82.00000
max    85.00000

In [75]:
df['marks'] #pulling up the 'marks' column

0    80
1    85
2    82
3    75
4    70
Name: marks, dtype: int64

In [76]:
df['marks'][2]  #pulling out the 3rd component of 'marks' column

82

In [77]:
df['marks'][2] = 80 #changing the very same component's value

C:\Users\joshr\AppData\Local\Temp\ipykernel_10312\336181118.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['marks'][2] = 80 #changing the very same component's value

In [78]:
df  #printed dataframe

      name  marks      state
0     Josh     80    Gujarat
1  Jayshil     85  Rajasthan
2   Pravin     80  Tamilnadu
3   Aakash     75  Rajasthan
4   Krenil     70    Gujarat

In [79]:
df.to_csv('friends.csv')    #pushed the modified data frme to csv file.

In [80]:
df.index = ['A', 'B', 'C', 'D', 'E']    #changed the indexes of dataframe.

In [81]:
df

      name  marks      state
A     Josh     80    Gujarat
B  Jayshil     85  Rajasthan
C   Pravin     80  Tamilnadu
D   Aakash     75  Rajasthan
E   Krenil     70    Gujarat

In [82]:
df.to_csv('friends.csv')    #exported the dtaframe to csv file.

In [83]:
josh = pd.read_csv('friends.csv')   #assigned the csv file to "josh".

In [84]:
josh

  Unnamed: 0     name  marks      state
0          A     Josh     80    Gujarat
1          B  Jayshil     85  Rajasthan
2          C   Pravin     80  Tamilnadu
3          D   Aakash     75  Rajasthan
4          E   Krenil     70    Gujarat

In [85]:
df

      name  marks      state
A     Josh     80    Gujarat
B  Jayshil     85  Rajasthan
C   Pravin     80  Tamilnadu
D   Aakash     75  Rajasthan
E   Krenil     70    Gujarat

In [86]:
df.to_csv('friends_indexfalse.csv') #exported the dtaframe to csv file.

In [87]:
josh1 = pd.read_csv('friends_indexfalse.csv')   #assigned the csv file to "josh1".

In [88]:
josh1

  Unnamed: 0     name  marks      state
0          A     Josh     80    Gujarat
1          B  Jayshil     85  Rajasthan
2          C   Pravin     80  Tamilnadu
3          D   Aakash     75  Rajasthan
4          E   Krenil     70    Gujarat